goals_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$f.HmqjF4MsAcuZnWE5.MIOty0jRXP7mZSLmEqy3fhHtb1L3VlZbXi"], ["updated_at", "2019-04-05 22:17:30.378282"], ["id", 47]]
---
  def update
    # @user = User.find_by_credentials(params[:user][:username], params[:user][:password])
    @user = User.find_by(id: params[:id])
    if @user.update_attributes(user_params)